{"keras_version": "1.2.0", "config": [{"config": {"W_regularizer": null, "activation": "relu", "nb_filter": 64, "border_mode": "valid", "nb_row": 5, "W_constraint": null, "batch_input_shape": [null, 64, 64, 1], "trainable": true, "init": "glorot_uniform", "input_dtype": "float32", "b_regularizer": null, "subsample": [1, 1], "b_constraint": null, "name": "convolution2d_1", "bias": true, "dim_ordering": "tf", "nb_col": 5, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_1", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"W_regularizer": null, "activation": "relu", "nb_filter": 32, "nb_row": 3, "border_mode": "valid", "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "subsample": [1, 1], "dim_ordering": "tf", "name": "convolution2d_2", "trainable": true, "bias": true, "nb_col": 3, "activity_regularizer": null}, "class_name": "Convolution2D"}, {"config": {"pool_size": [2, 2], "strides": [2, 2], "border_mode": "valid", "dim_ordering": "tf", "name": "maxpooling2d_2", "trainable": true}, "class_name": "MaxPooling2D"}, {"config": {"p": 0.2, "trainable": true, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"W_regularizer": null, "activation": "relu", "bias": true, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_1", "trainable": true, "output_dim": 128, "input_dim": 6272}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "relu", "bias": true, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_2", "trainable": true, "output_dim": 50, "input_dim": 128}, "class_name": "Dense"}, {"config": {"W_regularizer": null, "activation": "softmax", "bias": true, "W_constraint": null, "b_constraint": null, "init": "glorot_uniform", "b_regularizer": null, "activity_regularizer": null, "name": "dense_3", "trainable": true, "output_dim": 2, "input_dim": 50}, "class_name": "Dense"}], "class_name": "Sequential"}